БухЭксп/InformationRegisters/CW_СтатусыОборудованияНаСлежении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыОборудованияНаСлежении</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыОтслеживаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСлежения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыОборудованияНаСлежении/Ext/ManagerModule.bsl
Процедура ОчиститьЗаписиРегистра(ОбъектСлежения, Грузоперевозка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_СтатусыОборудованияНаСлежении.ОбъектСлежения КАК ОбъектСлежения
	|ИЗ
	|	РегистрСведений.CW_СтатусыОборудованияНаСлежении КАК CW_СтатусыОборудованияНаСлежении
	|ГДЕ
	|	CW_СтатусыОборудованияНаСлежении.Грузоперевозка = &Грузоперевозка
	|	//УСЛОВИЕ_ПО_ОБЪЕКТУ_СЛЕЖЕНИЯ"; 
	
	Если ЗначениеЗаполнено(ОбъектСлежения) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УСЛОВИЕ_ПО_ОБЪЕКТУ_СЛЕЖЕНИЯ", "И CW_СтатусыОборудованияНаСлежении.ОбъектСлежения = &ОбъектСлежения");
		
		Запрос.УстановитьПараметр("ОбъектСлежения", ОбъектСлежения);  
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Грузоперевозка", Грузоперевозка);  
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() ЦИкл
		
		Набор = РегистрыСведений.CW_СтатусыОборудованияНаСлежении.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектСлежения.Установить(Выборка.ОбъектСлежения);
		Набор.Прочитать();   
		
		ТаблицаНабора = Набор.Выгрузить();  
		
		Отбор = Новый Структура("ОбъектСлежения,Грузоперевозка",Выборка.ОбъектСлежения, Грузоперевозка);
		
		НайденныеСтроки = ТаблицаНабора.НайтиСтроки(Отбор); 
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаТаблицы из НайденныеСтроки Цикл
			ТаблицаНабора.Удалить(СтрокаТаблицы);
		КонецЦикла; 
		
		Набор.Загрузить(ТаблицаНабора);
		Набор.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьДанныеВРегистр(СтатусыОборудования) Экспорт
	
	//Контроль таблицы статусов
	ВремТаблица = СтатусыОборудования.Скопировать();
	ВремТаблица.Свернуть("Период",);
	
	Если ВремТаблица.Количество() <> СтатусыОборудования.Количество() Тогда
		ВызватьИсключение 	"Ошибка записи статусов оборудования на слежении!
		|Дата и время контрольных дат, определяющих статус оборудования на слежении, должны различаться хотя бы на одну минуту! 
		|Проверьте фактические значения контрольных дат и повторите попытку записи.";
	КонецЕсли;
	//Контроль таблицы статусов
	
	Для Каждого СтрокаТаблицы из СтатусыОборудования Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Период) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьРегистра = РегистрыСведений.CW_СтатусыОборудованияНаСлежении.СоздатьМенеджерЗаписи();   
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицы);
		ЗаписьРегистра.Записать(); 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПустуюТаблицуСтатусовОборудования() Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 0
	               |	CW_СтатусыОборудованияНаСлежении.Период КАК Период,
	               |	CW_СтатусыОборудованияНаСлежении.ОбъектСлежения КАК ОбъектСлежения,
	               |	CW_СтатусыОборудованияНаСлежении.Грузоперевозка КАК Грузоперевозка,
	               |	CW_СтатусыОборудованияНаСлежении.Статус КАК Статус,
	               |	CW_СтатусыОборудованияНаСлежении.Описание КАК Описание
	               |ИЗ
	               |	РегистрСведений.CW_СтатусыОборудованияНаСлежении КАК CW_СтатусыОборудованияНаСлежении";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
